app/Controllers/Admin/Penggajian.php

    public function index()
    {
        $model = new Penggajian_model;
        $data['title'] = 'Data Penggajian Gaji Karyawan';
        $data['getPenggajian'] = $model->getPenggajian();

        $employeeModel = new Employee_model;
        $data['employees'] = $employeeModel->findAll();

        $potonganModel = new Potongan_model;
        $data['potongans'] = $potonganModel->findAll();

        $tunjanganModel = new Tunjangan_model;
        $data['tunjangans'] = $tunjanganModel->findAll();
---
SELECT *
FROM `employees`
SELECT *
FROM `potongan`
SELECT *
FROM `tunjangan`