app/Models/Employee_model.php

    public function getKaryawan($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `employees`