app/Models/Penggajian_model.php

    public function getPenggajian($id = false)
    {
        if ($id === false) {
            return $this->select('penggajian.*, employees.nama_karyawan, potongan.nama_potongan, tunjangan.nama_tunjangan')
                ->join('employees', 'employees.id = penggajian.id')
                ->join('potongan', 'potongan.id_potongan = penggajian.id_potongan')
                ->join('tunjangan', 'tunjangan.id_tunjangan = penggajian.id_tunjangan')
                ->findAll();
---
SELECT `penggajian`.*, `employees`.`nama_karyawan`, `potongan`.`nama_potongan`, `tunjangan`.`nama_tunjangan`
FROM `penggajian`
JOIN `employees` ON `employees`.`id` = `penggajian`.`id`
JOIN `potongan` ON `potongan`.`id_potongan` = `penggajian`.`id_potongan`
JOIN `tunjangan` ON `tunjangan`.`id_tunjangan` = `penggajian`.`id_tunjangan`