app/Models/Potongan_model.php

    public function getPotongan($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `potongan`