app/Models/Tunjangan_model.php

    public function getTunjangan($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `tunjangan`